STMicroelectronics/STM32CubeWB/Projects/STM32WB5MM-DK/Applications/BLE/BLE_Mesh_ThermometerSensor/STM32_WPAN/app/appli_mesh.c
MOBLEUINT8 prev_temp = 0;
MOBLEUINT8 actual_temp = 0; 

/********************* Application configuration **************************/
#if defined(__GNUC__) || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM)
MOBLEUINT8 bdaddr[8];

#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void);
#endif /* INTERNAL_UNIQUE_NUMBER_MAC */

const void *mobleNvmBase; 
const void *appNvmBase;
const void *prvsnr_data;
#else
#error "Unknown compiler"
#endif /* __GNUC__ || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM) */

#if ENABLE_SERIAL_INTERFACE
extern uint8_t button_emulation;
#endif

/* Private function prototypes -----------------------------------------------*/
static void Appli_LongButtonPress(void);
static void Appli_ShortButtonPress(void);
#if USER_OUTPUT_OOB_APPLI_PROCESS
void Appli_OobAuthenticationProcess(void);
#endif
#ifdef ENABLE_AUTH_TYPE_INPUT_OOB
static void InputOOBTimeOutTask(void);
#endif
void BLEMesh_UnprovisionCallback(MOBLEUINT8 reason);
void Appli_LowPowerProcess(void);
#if (APPLI_OPTIM == 1)
static void AppliMeshTask(void);
#endif
void Appli_GetPublicationParamsCb(model_publicationparams_t* pPubParameters);
WEAK_FUNCTION (void SerialPrvn_ProvisioningStatusUpdateCb(uint8_t flagPrvningInProcess, 
                                                          MOBLEUINT16 nodeAddress));

/* Private functions ---------------------------------------------------------*/
void LED_Deinit(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure = {0};
  
  /* RGB Led de-init */
  BSP_PWM_LED_DeInit();

  /* configure SPIx MOSI for LCD */
  GPIO_InitStructure.Pin       = BUS_SPI1_MOSI_PIN;
  GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull      = GPIO_PULLDOWN;
  GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStructure.Alternate = BUS_SPI1_AF;
  HAL_GPIO_Init(BUS_SPI1_GPIO_PORTA, &GPIO_InitStructure);
}


void LED_On(aPwmLedGsData_TypeDef aPwmLedGsData)
{
  BSP_PWM_LED_Init();
  HAL_Delay(BSP_PWM_DELAY);
  BSP_PWM_LED_On(aPwmLedGsData);
  HAL_Delay(BSP_PWM_DELAY);
  LED_Deinit();
}

void LED_Off(void)
{
  BSP_PWM_LED_Init();
  HAL_Delay(BSP_PWM_DELAY);
  BSP_PWM_LED_Off();
  HAL_Delay(BSP_PWM_DELAY);
  LED_Deinit();
}

/************************* Button Control functions ********************/
/**
* @brief  Function calls when a button is pressed for short duration  
* @param  void
* @retval void
*/ 
static void Appli_ShortButtonPress(void)
{
  aPwmLedGsData_TypeDef aPwmLedGsData_app;
//  BLEMesh_ModelsCommand();
  aPwmLedGsData_app[PWM_LED_RED]   = PWM_LED_GSDATA_OFF;
  aPwmLedGsData_app[PWM_LED_GREEN] = PWM_LED_GSDATA_7_0;
  aPwmLedGsData_app[PWM_LED_BLUE]  = PWM_LED_GSDATA_OFF;
  
  BSP_PWM_LED_Init();
  HAL_Delay(BSP_PWM_DELAY);
  BSP_PWM_LED_Toggle(aPwmLedGsData_app);
  HAL_Delay(BSP_PWM_DELAY);
  LED_Deinit();
}
  

/**
* @brief  Function calls when a button is pressed for Long duration  
* @param  void
* @retval void
*/ 
static void Appli_LongButtonPress(void)
{
  IntensityPublish();
}

/**
* @brief  Updates the button status  
* @param  int isPressed
* @retval void
*/ 
static void Appli_UpdateButtonState(int isPressed)
{
  uint32_t t0 = 0,t1 = 1;

  t0 = Clock_Time(); /* SW1 press timing */
  
  while(BSP_PB_GetState(BUTTON_USER1) == BUTTON_PRESSED);
  t1 = Clock_Time(); /* SW1 release timing */
  
  if((t1 - t0) > LONG_PRESS_THRESHOLD)
  {
    Appli_LongButtonPress();
  }
  else if((t1 - t0) > BOUNCE_THRESHOLD)
  {
    /* Button 1 short press action */
    Appli_ShortButtonPress();
  }
}

/**
* @brief  task for the BLE MESH, the MESH Models and the Appli processes  
* @param  void
* @retval void
*/ 
static void Mesh_Task()
{
  BLEMesh_Process();
  BLEMesh_ModelsProcess(); /* Models Processing */
  
  if((UnprovisionInProgress > 0) &&
     (!LL_FLASH_IsActiveFlag_OperationSuspended()))
  {
    UnprovisionInProgress = 0;
    AppliNvm_ClearModelState();
    PalNvmErase(PRVN_NVM_BASE_OFFSET, 4);
    TRACE_M(TF_PROVISION,"NVM erased\r\n");      
    TRACE_M(TF_PROVISION,"Device is unprovisioned by application \r\n");      
  }
    
#if (APPLI_OPTIM == 0)
  /* Set the task in the scheduler for the next execution */
#if (LOW_POWER_FEATURE == 0)
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#endif
#endif
}

/**
* @brief  task for the BLE MESH, the MESH Models and the Appli processes  
* @param  void
* @retval void
*/ 
static void Appli_Task()
{
  Appli_Process();
  
#if (APPLI_OPTIM == 0)
  /* Set the task in the scheduler for the next execution */
#if (LOW_POWER_FEATURE == 0)
  UTIL_SEQ_SetTask( 1<<CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
#endif
#endif
}

#ifdef THERMOMETER_NODE
/**
* @brief  Timer callback for temperature measurement and publication over MESH 
* @param  void
* @retval void
*/ 
static void PublishTempTimerCb(void)
{
  /* Set the task in the scheduler for the next execution */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_TEMP_PUB_REQ_ID, CFG_SCH_PRIO_0);

  return;
}

/**
* @brief  task for the BLE MESH, publish measured temperature over MESH 
* @param  void
* @retval void
*/ 
static void PublishTemp_Task()
{

  float temp_val;
  
  STTS22H_getTemperatureValue(&temp_val);
  
  actual_temp = (MOBLEINT8)(round((double)(temp_val)));

  if((abs(actual_temp-prev_temp)) > 0)
  {
    Appli_Vendor_Publish_Temperature(BLEMesh_GetAddress(), actual_temp);
    prev_temp=actual_temp;
  }

}
#endif /* THERMOMETER_NODE */

/************************* LED Control functions ********************/
/**
* @brief  Controls the state of on board LED
* @param  void
* @retval void
*/ 
void Appli_LedCtrl(void)
{
  aPwmLedGsData_TypeDef aPwmLedGsData_app;
  if(Appli_LedState)
  {
    aPwmLedGsData_app[PWM_LED_RED]   = PWM_LED_GSDATA_OFF;
    aPwmLedGsData_app[PWM_LED_GREEN] = PWM_LED_GSDATA_OFF;
    aPwmLedGsData_app[PWM_LED_BLUE]  = PWM_LED_GSDATA_7_0;
    LED_On(aPwmLedGsData_app);
  }
  else
  {
    LED_Off();
  }
}

/************* BLE-Mesh library callback functions ***************/

/**
* @brief  Blinks the on board LED  
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_LedBlink(void)
{
  /* Switch On the LED */
  Appli_LedState = 1;
  Appli_LedCtrl();
  Clock_Wait(500);
  
  /* Switch Off the LED */
  Appli_LedState = 0;
  Appli_LedCtrl();
  Clock_Wait(500);
  
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  Callback function Sets the state of the bulb 
* @param  MOBLEUINT16 ctrl which sets the lighting state of LED
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_LedStateCtrlCb(MOBLEUINT16 ctrl)
{
  /* Switch On the LED */
  if(ctrl > 0)
  {
    Appli_LedState = 1;
  }
  /* Switch Off the LED */
  else
  {
    Appli_LedState = 0;
  }
  
  Appli_LedCtrl();
  
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  initializes BLE Stack    
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleStackInitCb()
{
  /* BLE Stack initialization */
  /* Not Required in BLE */
  return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  Sets transmission power of RF 
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleSetTxPowerCb(void)
{
  tBleStatus status;
  /* API to change the Transmission power of BLE Device */
  /* uint8_t en_high_power, uint8_t pa_level
  en_high_power Can be only 0 or 1. Set high power bit on or off.
  pa_level Can be from 0 to 7. Set the PA level value
  */ 
  status = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
  if (status)
    return MOBLE_RESULT_FAIL;
  else
    return MOBLE_RESULT_SUCCESS;
}

/**
* @brief  SET UUID value 
* @param  uuid_prefix_data : Pointer of UUID buffer data
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleSetUUIDCb(MOBLEUINT8 *uuid_prefix_data)
{
  /* UUID is 128 bits (16 bytes) and can guarantee uniqueness across space and time.
     It can be "Time-based" UUID or "truly-random or pseudo-random numbers"
 
     In this buffer user need to fill 10 bytes of UUID data. 
     Remaining 6 bytes, library fill this data with BDaddress.

    For example :
        F81D4FAE-7DEC-XBC4-Y12F-17D1AD07A961 (16 bytes)
        <any number> |_|  |_|   <BDAddress>

