STMicroelectronics/STM32CubeWB/Projects/STM32WB5MM-DK/Applications/BLE/BLE_Mesh_ThermometerSensor/STM32_WPAN/app/appli_mesh.c
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  if(PrvngInProcess)
  {
#if USER_OUTPUT_OOB_APPLI_PROCESS
    Appli_OobAuthenticationProcess();
#endif
  }
#endif

#ifdef TPT_LAYER_BUSY_TEST      
  if(BLEMesh_TrsptIsBusyState())
  {
    //SdkEvalLedOn(LED1);  
  }
  else
  {
    //SdkEvalLedOff(LED1);
  }
#endif
}

#if PB_ADV_SUPPORTED
static void UnprovisionedDeviceBeaconApp(void)
{
  BLEMesh_SetUnprovisionedDevBeaconInterval(0);
}

static void UnprovisionedDeviceBeaconTask(void)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_BEACON_REQ_ID, CFG_SCH_PRIO_0);

  return;
}
#endif

#if (APPLI_OPTIM == 1)
static void AppliMeshTask(void)
{
  /* Set the task in the scheduler for the next execution */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);

  return;
}
#endif

static void AppliMeshSW1Task(void)
{
  /* Check if button action is emulated with SW1 command on USART1 */
#if ENABLE_SERIAL_INTERFACE
  if(!button_emulation)
  {
    Appli_UpdateButtonState(BSP_PB_GetState(BUTTON_USER1) == BUTTON_PRESSED);
  }
  else
  {
    /* Button 1 short press action */
    Appli_ShortButtonPress();
    button_emulation = 0;
  }
#else
    Appli_UpdateButtonState(BSP_PB_GetState(BUTTON_USER1) == BUTTON_PRESSED);
#endif  
  return;
}

#if (ENABLE_SENSOR_MODEL_SERVER != 0)
static void AppliMeshSW3Task(void)
{
  Sensor_UpdatePublishState(0, 1);
  
  Appli_Sensor_Update(0, 1);
  
#if ENABLE_SERIAL_INTERFACE
  /* Reset button_emulation state in case of emulation with SW3 command on USART1 */
  button_emulation = 0;
#endif  
  return;
}
#endif

#if (LOW_POWER_FEATURE == 1)
static void LowPowerNodeApiApp(void)
{
  TRACE_I(TF_PROVISION,"Scan disabled \r\n");
  BLEMesh_LpnDisableScan();
    
  return;
}

static void LowPowerNodeApiTask(void)
{
  /* Set the task in the scheduler for the next execution */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_LPN_REQ_ID, CFG_SCH_PRIO_0);
  
  return;
}
#endif

#ifdef SAVE_MODEL_STATE_POWER_FAILURE_DETECTION       
/**
* @brief function to inintiallise the GPIO interrupt for Power down 
* @param  void
* @retval void
*/
static void GPIO_InitNVICPowerOff(void)
{
  GPIO_InitTypeDef gpioinitstruct = {0};
  
  /* Enable the PowerOff GPIO Clock */
  POWEROFF_GPIO_CLK_ENABLE();
  
  /* Configure PowerOff pin as input with External interrupt */
  gpioinitstruct.Pin  = POWEROFF_PIN;
  gpioinitstruct.Pull = GPIO_PULLUP;
  gpioinitstruct.Mode = GPIO_MODE_IT_FALLING; 
  HAL_GPIO_Init(POWEROFF_GPIO_PORT, &gpioinitstruct);
  
  /* Enable and set PowerOff EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)(POWEROFF_EXTI_IRQn), 0x0F, 0x00);
  HAL_NVIC_EnableIRQ((IRQn_Type)(POWEROFF_EXTI_IRQn));
}
#endif

/**
* @brief  Initializes the Application  
* @param  void
* @retval void
*/
void Appli_Init(MOBLEUINT8 *flag)
{
#if 0
#ifdef ENABLE_UNPROVISIONING_BY_POWER_ONOFF_CYCLE  
/* Hardware Factory Restore implementation */
  AppliNvm_FactorySettingReset();
#endif
#endif
  
#if PB_ADV_SUPPORTED
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_BEACON_REQ_ID, UTIL_SEQ_RFU, UnprovisionedDeviceBeaconApp );
  /**
   * Create Timer to control unprovisioned device beacons
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &discoverTimer_Id, hw_ts_SingleShot, UnprovisionedDeviceBeaconTask);
  
  HW_TS_Start(discoverTimer_Id, DISCOVER_TIMER_INTERVAL);
#endif
  
#if ENABLE_SERIAL_INTERFACE
  Serial_Init();
#endif
  
#ifdef SAVE_MODEL_STATE_POWER_FAILURE_DETECTION       
  GPIO_InitNVICPowerOff();
#endif 
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_SW1_REQ_ID, UTIL_SEQ_RFU, AppliMeshSW1Task );
  
#if (ENABLE_CUSTOM_BEACON == 1)
  BLEMesh_SetCustomBeaconInterval(CUSTOM_BEACON_INTERVAL);
#endif

#if (LOW_POWER_FEATURE == 1)  
  /**
  * Create Timer to control unprovisioned device beacons
  */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &lowPowerNodeApiTimer_Id, hw_ts_SingleShot, LowPowerNodeApiTask);
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_LPN_REQ_ID, UTIL_SEQ_RFU, LowPowerNodeApiApp );
  LPN_scan_enabled = MOBLE_FALSE;
#endif
#if (ENABLE_SENSOR_MODEL_SERVER != 0)
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_SW3_REQ_ID, UTIL_SEQ_RFU, AppliMeshSW3Task );
#endif

#ifdef ENABLE_AUTH_TYPE_INPUT_OOB
  /**
  * Create Timer to control Input OOB information
  */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &InputOOBTimeOut_Id, hw_ts_SingleShot, InputOOBTimeOutTask);
#endif
}

/*****************************Config Model Callbacks***************************/
/**
* @brief  Callback from Config Model to receive the Publication Parameters
* @param  Structure Pointer having parameters - modelID, elementAddress,
*         Publish Address, PublishPeriod, PublishTTL, Credential Flag, 
*         Publish AppKeyIndex, Retransmit Count & Restransmit Interval Steps
* @retval none
*/ 
void Appli_GetPublicationParamsCb(model_publicationparams_t* pPubParameters)
{
  if(pPubParameters->modelID == SENSOR_SERVER_MODEL_ID)
  {
    Sensor_ModelPublishSet(pPubParameters);
  }
}


/**
* @brief  PWM_CoolValue: This function is used to calculate the value for the 
          cool temperature for the light.
* @param  colourValue: Temperature value ratio
* @param  brightValue: Lightness value ratio.
* @retval duty: duty for the PWM
*/ 
MOBLEUINT16 PWM_CoolValue(float colourValue ,float brightValue)
{
  float colourDuty; 
  MOBLEUINT16 duty;
  
  colourDuty = colourValue * brightValue;    
  duty = (MOBLEUINT16)(colourDuty * PWM_TIME_PERIOD);
  
  return duty;
}


/**
* @brief  PWM_WarmValue: This function is used to calculate the value for the 
          warm temperature for the light.
* @param  colourValue: Temperature value ratio
* @param  brightValue: Lightness value ratio.
* @retval duty: duty for the PWM
*/ 
MOBLEUINT16 PWM_WarmValue(float colourValue ,float brightValue)
{
  float warmDuty;    
  MOBLEUINT16 duty;
  
  warmDuty = (1-colourValue)* brightValue;
  duty = (MOBLEUINT16)(warmDuty * PWM_TIME_PERIOD);
  
  return duty;
}

/**
* @brief  PwmValueMapping: This function takes the value as parameter from the 
*         model and return the value according to .
* @param  setValue: value to be set from model
* @param  maxRange: Max range of the parameter
* @param  minRange: Min range of the parameter
* @retval MOBLEUINT8
*/
MOBLEUINT16 PwmValueMapping(MOBLEUINT16 setValue , MOBLEUINT16 maxRange , MOBLEINT16 minRange)
{
  MOBLEUINT16 percentValue;
  MOBLEUINT16 duty;
  
#ifdef SMART_PLUG
   percentValue =  (setValue * 100)/ (maxRange - minRange);
        
   if(percentValue < 2)
   {
     duty = 0;
   }   
   else if((percentValue > 2) && (percentValue <= 10))
   {
     duty = 1;
   }
   else if((percentValue > 10) && (percentValue <= 20))
   {
     duty = 2;
   }
   else if((percentValue > 20) && (percentValue <= 30))
   {
     duty = 3;
   }
   else if((percentValue > 30) && (percentValue <= 40))
   {
     duty = 4;
   }
   else if((percentValue > 40) && (percentValue <= 50))
   {
     duty = 5;
   }
   else if((percentValue > 50) && (percentValue <= 60))
   {
     duty = 6;
   }
   else if((percentValue > 60) && (percentValue <= 70))
   {
     duty = 7;
   }
   else if((percentValue > 70) && (percentValue <= 80))
   {
     duty = 8;
   }
   else if((percentValue > 80) && (percentValue <= 90))
   {
     duty = 9;
   }
   else if(percentValue > 90)
   {
     duty = 10;
   }
#else
   if(minRange > 0x00)
   {
     percentValue =  (setValue - 800)/ (maxRange - minRange);
     percentValue = (percentValue*100);
   }
   else
   {
     percentValue =  (setValue * 100)/ (maxRange - minRange);
   }
   
   duty = percentValue*320 ;
   
   if(duty >= 32000)
   {
     duty = 31999;
   }
   if(duty == 0)
   {
     duty = 1;
   }
#endif
     
   return duty;
}


/************************************ Weak linking ***********************************
If implemented in application, linker would replace weak linking in library */
WEAK_FUNCTION (void SerialPrvn_ProvisioningStatusUpdateCb(uint8_t flagPrvningInProcess, MOBLEUINT16 nodeAddress))
{
    
}


/**
* @}
*/

/**
* @}
*/
